# -*- coding: utf-8 -*-
# ---
# jupyter:
#   jupytext:
#     formats: ipynb,jl:light
#     text_representation:
#       extension: .jl
#       format_name: light
#       format_version: '1.5'
#       jupytext_version: 1.14.4
#   kernelspec:
#     display_name: Julia 1.8.5
#     language: julia
#     name: julia-1.8
# ---

versioninfo()

# ## 2-3. 演算子

# ### 2-3-1. 算術演算子

# #### 除算演算子

# ##### コード2-25. 各種除算演算子の例(1)

4 / 2

7 / 5

4 ÷ 2

7 ÷ 5

4 // 2

7 // 5

# ##### コード2-26. 各種除算演算子の例(2)

7.0 / 5.0

7.0 ÷ 5.0

7.0 // 5.0

(5//3) / (1//2)

(5//3) ÷ (1//2)

(5//3) // (1//2)

(1 + im) / (1 - im)

(1 + im) ÷ (1 - im)

(1 + im) // (1 - im)

(1.0 + im) // (1.0 - im)

# #### 冪乗演算子

# ##### コード2-27. 冪乗演算子の例

2^(1//2)

2^0.3

3.2^0.3

ℯ^(π/4*im)

# ### 2-3-2. ビット演算子

# #### コード2-28. ビット演算子の例(1)

bitstring(0x123a)

bitstring(~0x123a)

x = Int16(123);
bitstring(x)

y = Int16(234);
bitstring(y)

bitstring(x & y)

bitstring(x | y)

bitstring(x ⊻ y)

# #### コード2-29. ビット演算子の例(2)

bitstring(Int8(-30))

bitstring(Int8(-30) >>> 2)

bitstring(Int8(-30) >> 2)

bitstring(Int8(-30) << 2)

bitstring(0xe2)

bitstring(0xe2 >>> 2)

bitstring(0xe2 >> 2)

bitstring(0xe2 << 2)

# ### 2-3-3. 論理演算子

# ### 2-3-4. 文字列操作演算子

# ### 2-3-5. 代入演算子

# #### コード2-30. 代入演算子の例(1)：変数・定数への代入（束縛）

x = 123

x

const xx = 1.5

xx

# #### コード2-31. 代入演算子の例(2)：一括代入・分割代入

x₁, x₂, x₃ = 1, 2, 3  # 一括代入

x₁

x₂

x₃

(x₁, x₂, x₃) = 4, 5, 6  # 一括代入（左辺タプル書式）

x₁

x₂

x₃

v = Float64[1, 2, 3];

x₁, x₂, x₃ = v;  # 分割代入

(x₁, x₂, x₃)

(x₁, x₂, (x₃, x₄, x₅)) = (11, 21, [31, 32, 33]);  # 一括代入・分割代入の入れ子

(x₁, x₂, x₃, x₄, x₅)

x₁, x₂ = v;  # 左辺の変数が少ない分割代入（エラーにならない）

(x₁, x₂)

x₁, x₂, x₃, x₄ = v;  # 左辺の変数が多い分割代入（エラー）

# #### コード2-32. 代入演算子の例(3)：プロパティ分割代入

VERSION

nt = (a=1, b=2)

(; a, b) = nt  # （結果的には）`a = nt.a; b = nt.b` というコードと同等

a

b

(; a) = nt;  # OK

(; b, a) = nt;  # OK

(; a, b, c) = nt;  # NG

# ### 2-3-6. 比較演算子

# #### 同値演算子

# ##### コード2-33. 同値演算子の例（等価演算子との比較）

pi === π  # 同じ値を指し示す定数

pi == π

1:10 == [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

1:10 === [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]  # 値としては同じだがオブジェクトとしては別物

# #### 等価演算子

# ##### コード2-34. 近似値演算子の例（等価演算子との比較）

about03 = 0.1 + 0.1 + 0.1

about03 == 0.3

about03 ≈ 0.3

about03 ≉ 0.300001

# #### 包含演算子

# ##### コード2-35. 包含演算子の例(1)：「属する」/「含む」

x = 1;
y = 2;
A = [1, 3, 5];

x in A

x ∈ A

y ∉ A

A ∋ x

A ∌ y

# ##### コード2-36. 包含演算子の例(2)：「部分集合」

A1 = [1, 2, 3];
B1 = 1:5;
B2 = [2, 3, 4];

A1 ⊆ B1

B1 ⊇ A1

A1 ⊈ B2

A1 ⊉ B2

A1 ⊊ B1

B1 ⊋ A1

# #### 比較演算子の連鎖

# ##### コード2-37. 比較演算子の連鎖の例

x = 1;

0 ≤ x < 10

0 ≤ x < 2x ∈ 1:3 ⊊ 1:5 ⊇ 1:2:5 ∌ 2 == 2x

# ### 2-3-7. その他の演算子

# ### 2-3-8. 演算子の優先順位

# #### コラム. 演算子に使用できる Unicode 文字
